/**
  ******************************************************************************
  * @file     
  * @author   
  * @version  
  * @date     
  * @brief    
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#ifndef __TIM_H
#define __TIM_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported types ------------------------------------------------------------*/


/* Exported constants --------------------------------------------------------*/
//!!!!!!!!!!!!!!!!!!!!这段代码有问题    并不能关闭输出
#define	MACH_UpDown_EN		TIM_ITConfig(TIM3, TIM_IT_CC1 , ENABLE);
#define	MACH_UpDown_DIS		TIM_ITConfig(TIM3, TIM_IT_CC1 , DISABLE);
#define	MACH_OpenClose_EN	TIM_ITConfig(TIM3, TIM_IT_CC2 , ENABLE);
#define	MACH_OpenClose_DIS	TIM_ITConfig(TIM3, TIM_IT_CC2 , DISABLE);
 	
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void TIM3_Init(void);


#endif 

/**********************************************************END OF FILE***************************************/
